# -*- coding: utf-8 -*-
"""Копия Практика 0.2.0 .ipynb

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1XmFyWFoLvAm661kXikwTbEN5x6dgOcFz

Напишите свое ФИО:
"""

Сбродов Илья Андреевич

"""# Основы

Задание 1: Напиши программу, выводящую на экран сообщение "Привет, мир!"
"""

print("Привет, мир!")

"""Задание 2: Напиши программу которая запрашивает имя пользователя и выводит сообщение:

`Привет, <Имя пользователя>`
"""

name = input("Введите своё имя: ")
print("Привет,", name)

"""Задание 3: Напиши программу определяющую является ли число четным или нечетным:

Пример:

`Введите число:` 2

`Ваше число четное!`
"""

number = int(input("Введите своё число: "))
if number % 2 == 0:
   print("Ваше число чётное")
else:
   print("Ваше число нечётное")

"""Задание 4: Напишите программу которая запрашивает длину и ширину прямоугольника и выводит его площадь:



`Введите длинну прямоугольника:`

`Введите ширину прямоугольника:`

`Площадь прямоугольника: `


"""

lenght, width = int(input("Введите длину прямоугольнка: ")), int(input("Введите ширину прямоугольнка: "))
square = lenght * width
print("Площадь прямоугольнка:", square)

"""Задание 5: Напишите программу, которая будет вычислять среднее арифметическое введенных чисел"""

num_1 = int(input("Введите первое число: "))
num_2 = int(input("Введите второе число: "))
num_3 = int(input("Введите третье число: "))
numbers = [num_1, num_2, num_3]
print(sum(numbers)/len(numbers))

"""Задание 6: Напиши программу, которая бы определяла является ли год високосным"""

year = int(input("Введите год, который хотите проверить на високосность: "))
if year % 4 == 0:
   print("Этот год високосный!")
else:
   print("Данный год не високосный")

"""Задание 7: Необходимо создать простой калькулятор, который позволяет пользователю выбрать одну из четырёх операций (+, -, *, /), ввести два числа и получить результат выполнения операции."""

operation = input("Введите действие, которое планируете совершить: ")
num_1 = int(input("Введите первое число: "))
num_2 = int(input("Введите второе число: "))
if operation == "+":
   print(num_1+num_2)
elif operation == "-":
   print(num_1 - num_2)
elif operation == "*":
   print(num_1 * num_2)
elif operation == "/":
   print(num_1/num_2)

"""# Практика 0.2.1

**Шахматы**

Даны стартовые и конечные координаты, а также фигура

Необходимо определить, может ли заданная фигура так ходить?
"""

figure = input("Введите название фигуры с заглавной буквы: ")
x1 = int(input("Введите номер столбца начальной координаты: "))
y1 = int(input("Введите номер строки начальной координаты: "))
x2 = int(input("Введите номер столбца конечной координаты: "))
y2 = int(input("Введите номер строки конечной координаты: "))
if x1 <= 8 and x2 <= 8 and y1 <= 8 and y2 <= 8:
    if figure == "Ферзь":
        if abs(x1-x2) == abs(y1 - y2) or x1 == x2 or y1 == y2:
            print("Ферзь может так ходить")
        else:
            print("Ферзь не может так ходить")
    if figure == "Пешка":
        if y2-y1 == 1 and x1 == x2:
            print("Пешка может так ходить")
        else:
            print("Пешка не может так ходить")
    if figure == "Король":
        if abs(x1-x2) <= 1 and abs(y1-y2) <= 1:
            print("Король может так ходить")
        else:
            print("Король не может так ходить")
    if figure == "Ладья":
        if x1 == x2 or y1 == y2:
            print("Ладья может так ходить")
        else:
            print("Ладья не может так ходить")
    if figure == "Конь":
        if (abs(x1 - x2) == 1 and abs(y1 - y2) == 2) or (abs(x1-x2) == 2 and abs(y1-y2) == 1):
            print("Конь может так ходить")
        else:
            print("Конь не может так ходить")
    if figure == "Слон":
        if abs(x1-x2) == abs(y1 - y2):
            print("Слон может так ходить")
        else:
            print("Слон не может так ходить")
else:
    print("Поле максимум до 8")

"""# Практика 0.2.2

**Цифра на определенном месте:**

Последовательно записан натуральный ряд чисел.

Какая цифра стоит в N позиции
"""

num1 = [i for i in range(1,1000)]
num2  = (map(str,num1))
num3 = ''.join(num2)
position = num3[int(input('Введите позицию: '))-1]
print(position)

"""# Практика 0.2.3


Возьмите код из задания 7 и улучшите ваш калькулятор следующим образом:

Пользователь вводит строку вида:

(5+5)*5 - данная строка содержит в себе математическое выражение, а также скобки

Ваша программа должная понять что за математическое выражение записано, проверить верно ли оно записано (пример неверного заполнения: (5(+)5)*5, а также расчитать его в соотвествии с правилами математики
"""

def actions(operation, num1, num2):
    if operation == "+":
        num3 = (num1 + num2)
    elif operation == "-":
        num3 = (num1 - num2)
    elif operation == "*":
        num3 = (num1 * num2)
    elif operation == "/":
        num3 = (num1 / num2)
    return num3


expression = "(5+5)*5"
if "(" in expression and ")" in expression:
    if expression.count("(") == expression.count(")"):
        action1 = (expression[expression.find("(")+1: expression.find(")")])
        num3 = actions((action1[1]), int(action1[0]),int(action1[2]))
        expression1 = expression[expression.find(")")+1:]
        print(actions(expression1[0], num3,int(expression1[1])))